<?php

namespace App\Constant;

class FoodType
{
    // '縮寫' => ['中文',原價]
    const FOOD_COMMON = [
        'FCK' => ['炸雞', '63'],
        'EGT' => ['蛋塔', '39'],
        'FRS' => ['小薯', '29'],
        //'FRM' => ['中薯', '43'],
        'FRL' => ['大薯', '53'],
        'MCN' => ['雞塊', '11.25'],
        'CRS' => ['小雞米花', '39'],
        'CRL' => ['大雞米花', '45'],
        'SPB' => ['地瓜球', '49'],
        'OT1' => ['台酒花雕紙包雞', '132'],
    ];

    const FOOD_DRINK = [
        'DKS' => ['小飲', '27'],
        'DKM' => ['中飲', '32'],
        //'DKX' => ['1.25L飲', '40'],
    ];

    const FOOD_LESS = [
        'COR' => ['玉米', '29'],
        //'TOS' => ['小濃湯', '40'],
        'HB1' => ['原味脆腿堡', '90'],
        'HB2' => ['卡啦雞腿堡', '109'],
        'HB3' => ['花生熔岩雞腿堡', '129'],
        'HB4' => ['花生培根雞腿堡', '119'],
        'HB5' => ['紐奧良烤雞腿堡', '109'],
        'GBG' => ['紙包雞', '116'], //非官方
    ];

    const FOOD_MORE = [
        'FCK2' => ['炸雞x2', '126'],
        'FCK3' => ['炸雞x3', '189'],
        'EGT2' => ['蛋塔x2', '78'],
        'EGT3' => ['蛋塔x3', '117'],
        'MCN3' => ['雞塊x3', '36'], // 45/4.=.12 12*3
        'MCN4' => ['雞塊x4', '45'],
        'DES1' => ['點心盒(小雞米花+小薯)', '49'],
        'DES2' => ['點心盒(雞塊x3+小薯)', '49'],
    ];

}
