<?php

namespace App\Constant;

class FoodType
{
    // '縮寫' => ['中文', '原價']
    const FOOD_COMMON = [
        'EGT' => ['蛋塔', '39'],
        'FRS' => ['小薯', '29'],
        //'FRM' => ['中薯', '43'],
        'FRL' => ['大薯', '53'],
        'MCN' => ['雞塊', '11.25'],
        'FCK' => ['炸雞', '63'],
        'GBG' => ['紙包雞(停售)', '126'],
        //'OT1' => ['台酒花雕紙包雞', '132'],
        'HB1' => ['原味脆腿堡', '90'],
        'HB2' => ['卡啦雞腿堡', '109'],
    ];

    const FOOD_DRINK = [
        'DKS' => ['小飲', '27'],
        'DKM' => ['中飲', '32'],
        //'DKX' => ['1.25L飲', '40'],
    ];

    const FOOD_LESS = [
        //'FCKA' => ['青花椒炸雞', '66'],
        //'HB3' => ['花生熔岩雞腿堡', '129'],
        'HB4' => ['花生培根雞腿堡', '119'],
        'HB5' => ['紐奧良烤雞腿堡', '109'],
        'SPB' => ['地瓜球', '49'],
        'TOS' => ['小濃湯', '40'],
        'COR' => ['玉米', '29'],
        'COS' => ['洋蔥圈', '48'],
        // 'CRS' => ['小雞米(停售)', '39'],
        // 'CRL' => ['大雞米(停售)', '45'],
    ];

    const FOOD_MORE = [
        'FCK2' => ['炸雞x2', '126'],
        'FCK3' => ['炸雞x3', '189'],
        'EGT2' => ['蛋塔x2', '78'],
        'EGT3' => ['蛋塔x3', '117'],
        'MCN3' => ['雞塊x3', '36'], // 45/4.=.12 12*3
        'MCN4' => ['雞塊x4', '45'],
        'DES2' => ['點心盒(雞塊x3+小薯)', '49'], // 由前端控制
        // 'DES1' => ['點心盒(小雞米花+小薯)', '49'], // 由前端控制
        // 'DES3' => ['點心盒(小雞米花+小薯)', '49'], // 由前端控制
    ];

    const FOOD_HIDE = [
        'D-EGT' => ['排除蛋塔', ''],
        'D-FRS' => ['排除小薯', ''],
        'D-FRL' => ['排除大薯', ''],
        'D-MCN' => ['排除雞塊', ''],
        'D-FCK' => ['排除炸雞', ''],
        'D-DKS' => ['排除小飲', ''],
        'D-DKM' => ['排除中飲', ''],
        'D-CRS' => ['排除小雞米花', '39'],
        'D-CRL' => ['排除大雞米花', '45'],
        'D-SPB' => ['排除地瓜球', ''],
    ];
}
